In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame([["James","Robert"],["James","Robert"],["James","Andrew"],["Robert","James"],["0101","2020"],["2020","0101"]],
                   columns=["ColA","ColB"])
df1

     ColA    ColB
0   James  Robert
1   James  Robert
2   James  Andrew
3  Robert   James
4    0101    2020
5    2020    0101

In [3]:
df2 = df1.drop_duplicates()
df2

     ColA    ColB
0   James  Robert
2   James  Andrew
3  Robert   James
4    0101    2020
5    2020    0101

In [4]:
df2['ColC'] = df2.apply(lambda x: x['ColA'] + '_' + x['ColB'] if x['ColA'] >= x['ColB'] else x['ColB'] + '_' + x['ColA'], axis=1)
df2

C:\ProgTools\Python\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

     ColA    ColB          ColC
0   James  Robert  Robert_James
2   James  Andrew  James_Andrew
3  Robert   James  Robert_James
4    0101    2020     2020_0101
5    2020    0101     2020_0101

In [5]:
df2.drop_duplicates(subset=["ColC"])

    ColA    ColB          ColC
0  James  Robert  Robert_James
2  James  Andrew  James_Andrew
4   0101    2020     2020_0101